app/controllers/api/currencies_controller.rb

    def currency_list
      render json: Currency.all.as_json
---
SELECT "currencies".* FROM "currencies"

    def currency_reserves
      render json: Currency.includes(:reserve).pluck(:name, :code, :currency_reserve).as_json
---
SELECT "currencies"."name", "currencies"."code", "currency_reserve" FROM "currencies" LEFT OUTER JOIN "reserves" ON "reserves"."currency_id" = "currencies"."id"